Задача 1. Офисные печеньки

Разработчик Фёдор очень любит печеньки в офисе, и точно знает все N мест, где их можно найти, а также точное количество печенек Сn в каждом месте. Сегодня Фёдор особенно голоден: он закончил большую задачу, и решает выделить себе M часов на то, чтобы съесть все печеньки в офисе.

Фёдор рассчитал минимальное количество печенек K, которое ему нужно съедать в течение часа так, чтобы в итоге успеть съесть все печеньки в офисе за выделенное время.

В каждый час, он может посетить одно любое место с печеньками и съесть K печенек в этом месте, он потратит на это целый час, даже если в этом месте осталось меньше, чем K печенек, потому что будет обсуждать с коллегами задачи и планы.

Коллеги, из уважения к Фёдору, никогда не трогают его любимые печеньки.

Ваша задача – найти минимально возможное K. Если Фёдор не успеет съесть все печеньки, или в офисе нет печенек – нужно вывести 0.

Пример:

3 6
4
4
5
